In [1]:
import pandas as pd 
df=pd.read_csv("convertcsv/Teams.csv")
print(df)

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   Kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

## Quest1-  Select the first value from the Points column of dataset, assigning it to variable first_point.

In [7]:
first_point=df.iloc[0,0]
print(first_point)

876

## Quest2- Select the first row of data (the first record)

In [20]:
print(df.iloc[[0][:]])

   Points  Rank    Team  Year
0     876     1  Riders  2014

## Quest3-  Select the first 10 values from the Year column in dataset

In [29]:
df.loc[:9,['Year']]

   Year
0  2014
1  2015
2  2014
3  2015
4  2014
5  2015
6  2016
7  2017
8  2016
9  2014

## Quest4-  Select the records with index labels 1, 2, 3, 5, and 8, assigning the result to the variable sample_records

In [62]:
sample_record=df.iloc[[1,2,3,5,8][:]]
print(sample_record)

   Points  Rank    Team  Year
1     789     2  Riders  2015
2     863     2  Devils  2014
3     673     3  Devils  2015
5     812     4   Kings  2015
8     694     2  Riders  2016

## Quest5-  Create a variable df containing the Rank, Points, Team columns of the records with the index labels 0, 5, 10.

In [73]:
df1=df.loc[0:11:5,['Rank','Points','Team']]
print(df1)

    Rank  Points    Team
0      1     876  Riders
5      4     812   Kings
10     1     804  Royals

## Quest6- Create a variable df containing the Team and Rank columns of the last 5 records.

In [75]:
df.loc[7:,['Rank','Team']]

    Rank    Team
7      1   Kings
8      2  Riders
9      4  Royals
10     1  Royals
11     2  Riders

## Quest7- Create a variable df containing all even index labels

In [76]:
df.iloc[0:11:2]

    Points  Rank    Team  Year
0      876     1  Riders  2014
2      863     2  Devils  2014
4      741     3   Kings  2014
6      756     1   Kings  2016
8      694     2  Riders  2016
10     804     1  Royals  2015

## Quest8-  Create a variable df containing all odd index labels

In [77]:
df.iloc[1:11:2]

   Points  Rank    Team  Year
1     789     2  Riders  2015
3     673     3  Devils  2015
5     812     4   Kings  2015
7     788     1   Kings  2017
9     701     4  Royals  2014